Revit 2027 API
Conduit.IsValidConduitType Method
 Identifies if a conduit type is valid.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidConduitType(
	Document document,
	ElementId conduitType
)
Public Shared Function IsValidConduitType (
	document As Document,
	conduitType As ElementId
) As Boolean
public:
static bool IsValidConduitType(
	Document^ document,
	ElementId^ conduitType
)
static member IsValidConduitType :
        document : Document *
        conduitType : ElementId -> bool
Parameters
document Document
 The document.
conduitType ElementId
 The conduit type.
Return Value
Boolean
 True if the conduit type is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Conduit Class
Autodesk.Revit.DB.Electrical Namespace